[
  {
    "title": "The Pre-Mortem ☠️",
    "phase": "Planning",
    "id": 1,
    "status": "pending",
    "journey_phase": "Planning",
    "toolsets_used": "Mind Map → Categories",
    "purpose": "Anticipate risks and classify them to create a mitigation strategy.",
    "how_it_works": "First, the user and AI collaborate on a Mind Map to brainstorm \"Everything that could go wrong\" with the plan. Then, the user transitions to Categories to sort those risk nodes into \"Within My Control\" and \"Outside My Control.\"",
    "output": "A risk assessment with a clear focus on actionable mitigations.",
    "why_this_works": "Mind Map encourages broad, non-linear brainstorming of fears, while Categories forces a logical filter so the user doesn't worry about uncontrollable factors."
  },
  {
    "title": "The Strategy Showdown ⚔️",
    "phase": "Planning",
    "id": 2,
    "status": "pending",
    "journey_phase": "Planning",
    "toolsets_used": "Branch Point (x3) → Callout Text",
    "purpose": "Force hard trade-offs to define the style of execution.",
    "how_it_works": "The AI presents 3 rapid Branch Points representing strategic trade-offs (e.g., \"Fast & Imperfect\" vs. \"Slow & Deliberate\"; \"Go Solo\" vs. \"Collaborate\"). Based on selections, the AI synthesizes a \"Strategy Statement\" displayed via Callout Text (e.g., \"Your Strategy: A collaborative sprint focusing on speed over precision.\").",
    "output": "A defined \"Rules of Engagement\" statement for their goal.",
    "why_this_works": "Users often have a goal but no \"how.\" Branch Points force them to commit to a methodology, preventing paralysis."
  },
  {
    "title": "The Resource Radar 📡",
    "phase": "Planning",
    "id": 3,
    "status": "pending",
    "journey_phase": "Planning",
    "toolsets_used": "Deck → Slider",
    "purpose": "Assess readiness and identify missing resources.",
    "how_it_works": "The user swipes through a Deck of potential resource types (e.g., \"Budget,\" \"Sponsorship,\" \"Time,\" \"Skillset\"). They select the ones critical to their goal. For each selected card, a Slider appears asking, \"How sufficiently do you have this?\" (0-100%).",
    "output": "A readiness heat-map identifying exactly where they are under-resourced.",
    "why_this_works": "Decks act as a prompt menu so users don't have to recall resource types from scratch; Sliders provide nuance beyond a simple yes/no."
  },
  {
    "title": "The Warm-Up Lab 🏋️",
    "phase": "Action",
    "id": 4,
    "status": "pending",
    "journey_phase": "Action",
    "toolsets_used": "Mock Chat → Likert Scale",
    "purpose": "Low-stakes rehearsal of a specific skill or conversation before the real event.",
    "how_it_works": "User enters a Mock Chat where the AI plays a specific persona (e.g., a skeptical stakeholder). After a 3-minute roleplay, the user completes a Likert Scale rating their performance/anxiety. The AI gives one specific tip based on the chat history.",
    "output": "Practice repetitions and a confidence score.",
    "why_this_works": "Reduces the \"threshold of action\" by allowing failure in a safe environment. The Likert provides a data point to track confidence improvements over time."
  },
  {
    "title": "Friction Logger 🧱",
    "phase": "Action",
    "id": 5,
    "status": "pending",
    "journey_phase": "Action (Recurring/Daily)",
    "toolsets_used": "Categories",
    "purpose": "track why intended actions aren't happening.",
    "how_it_works": "The AI presents Categories with columns: \"Done,\" \"Too Tired,\" \"No Time,\" \"Fear/Avoidance.\" The user drags today's intended tasks (pre-populated by AI) into the relevant bucket.",
    "output": "A structured diagnosis of what is actually blocking progress (e.g., \"You are consistently blocked by 'No Time' on Tuesdays\").",
    "why_this_works": "It moves the user from \"I failed\" (shame) to \"I was blocked by X\" (data). Drag-and-drop is faster and more tactile than typing excuses."
  },
  {
    "title": "Wisdom On Demand 🎧",
    "phase": "Action",
    "id": 6,
    "status": "pending",
    "journey_phase": "Action",
    "toolsets_used": "SME Council → Basic List",
    "purpose": "Real-time motivation or perspective shifting when stuck.",
    "how_it_works": "The user briefly describes their current roadblock. The AI generates a 3-minute SME Council audio (e.g., Brené Brown and Adam Grant personas debating the user's issue). While listening, the user populates a Basic List with \"Key Takeaways.\"",
    "output": "A clear mental shift and a list of insights to apply immediately.",
    "why_this_works": "Hearing voices (auditory learning) breaks the monotony of text/reading and feels like a high-value intervention during a slump."
  },
  {
    "title": "The Triage Tent ⛺",
    "phase": "Action",
    "id": 7,
    "status": "pending",
    "journey_phase": "Action",
    "toolsets_used": "Basic List → Quadrant",
    "purpose": "Overcoming overwhelm by sorting immediate tasks.",
    "how_it_works": "The user does a \"Brain Dump\" into a Basic List. Then, the AI initiates a Quadrant (Urgency vs. Importance). One by one, the AI asks the user to plot the list items onto the matrix.",
    "output": "A visual battle plan of what to ignore and what to do now.",
    "why_this_works": "This is the classic Eisenhower Matrix digitized. The flow (Dump → Sort) is the most effective way to lower cognitive load."
  },
  {
    "title": "Start / Stop / Continue 🛑",
    "phase": "Integration",
    "id": 8,
    "status": "pending",
    "journey_phase": "Integration (Weekly)",
    "toolsets_used": "Categories → Callout Text",
    "purpose": "Agile retrospective on the week's behaviors.",
    "how_it_works": "The AI loads a Categories tool with columns \"Start,\" \"Stop,\" and \"Continue.\" The user populates these with behaviors from the past week. The AI analyzes the board and synthesizes a \"Focus for Next Week\" displayed in Callout Text.",
    "output": "A clear behavioral adjustment plan for the next cycle.",
    "why_this_works": "It’s a standard, proven coaching framework. Using the sorting UI makes it feel like an activity rather than just a conversation."
  },
  {
    "title": "The Energy/Impact Audit ⚡",
    "phase": "Integration",
    "id": 9,
    "status": "pending",
    "journey_phase": "Integration",
    "toolsets_used": "Canvas Mapping",
    "purpose": "Visualize ROI on personal effort to prevent burnout.",
    "how_it_works": "The AI presents Canvas Mapping (X-Axis: Energy Drained, Y-Axis: Impact Created). The user plots their major activities from the last two weeks as bubbles.",
    "output": "Visual identification of \"Vampires\" (High Drain/Low Impact) and \"Wins\" (Low Drain/High Impact).",
    "why_this_works": "Users often feel tired but don't know why. Seeing tasks spatially helps them realize, \"Oh, I'm spending all my time in the bottom right corner.\""
  },
  {
    "title": "The Alignment Meter 📐",
    "phase": "Integration",
    "id": 10,
    "status": "pending",
    "journey_phase": "Integration",
    "toolsets_used": "Slider → Branch Point",
    "purpose": "Check if the \"North Star\" is still relevant.",
    "how_it_works": "The AI recalls the user's North Star. A Slider asks, \"How much does this goal still excite you?\" (0-100). If the score is below 70, a Branch Point triggers: \"Pivot the Goal\" or \"Change the Approach.\"",
    "output": "Validation of the current direction or a decision to pivot.",
    "why_this_works": "Goals shouldn't be static. This quick check-in prevents users from climbing the wrong mountain."
  },
  {
    "title": "The Insight Thread 🧵",
    "phase": "Integration",
    "id": 11,
    "status": "pending",
    "journey_phase": "Integration",
    "toolsets_used": "Contentful Cards → Basic List",
    "purpose": "Synthesize external learning with internal realization.",
    "how_it_works": "The user browses Contentful Cards related to their journey topic (e.g., \"Leading through Change\"). After reading/viewing, they use a Basic List to capture \"How this applies to my situation.\"",
    "output": "A set of actionable learnings grounded in expert content.",
    "why_this_works": "Reflection is hard in a vacuum. Providing stimulus (Contentful) first primes the pump for deeper insights."
  },
  {
    "title": "The Re-Ranking 📊",
    "phase": "Integration",
    "id": 12,
    "status": "pending",
    "journey_phase": "Integration",
    "toolsets_used": "Priorization",
    "purpose": "Re-evaluating priorities based on real-world experience.",
    "how_it_works": "The AI retrieves the user's values or goals from the Discovery phase. It presents them in the Priorization tool and asks, \"Given what you learned this week, is this order still true?\" The user drags to reorder.",
    "output": "An updated hierarchy of values/priorities.",
    "why_this_works": "Priorities shift once rubber hits the road. This tool operationalizes \"iterative growth\" by allowing the user to change their mind without shame."
  },
  {
    "title": "The Alliance Map 🤝",
    "phase": "Planning",
    "id": 13,
    "status": "pending",
    "journey_phase": "Planning",
    "toolsets_used": "Canvas Mapping",
    "purpose": "Identify who needs to be managed, informed, or leveraged to achieve the goal.",
    "how_it_works": "The AI presents a Canvas Mapping tool (X-Axis: Level of Support, Y-Axis: Level of Influence). The user plots key stakeholders (boss, peer, spouse, team). The AI then asks for one specific tactic to move a high-influence person from \"Neutral\" to \"Support.\"",
    "output": "A visual map of the political landscape and a communication strategy.",
    "why_this_works": "Plans often fail not because of bad strategy, but because of ignored stakeholders. The visual grid makes \"invisible\" relationship dynamics obvious."
  },
  {
    "title": "The Delegation Deck 🗂️",
    "phase": "Planning",
    "id": 14,
    "status": "pending",
    "journey_phase": "Planning",
    "toolsets_used": "Deck → Categories",
    "purpose": "Reduce overwhelm by ruthlessly filtering tasks before starting.",
    "how_it_works": "The AI populates a Deck with standard responsibilities for the user's role/goal. The user selects the cards involved in the project. Then, the user transitions to Categories to sort those cards into: \"Only I Can Do,\" \"Train Someone Else,\" and \"Automate/Delete.\"",
    "output": "A leaner, focused role definition and a list of tasks to offload.",
    "why_this_works": "Users often assume they have to do everything. Physically moving a card to \"Train Someone Else\" is a psychological permission slip to let go."
  },
  {
    "title": "Success Metrics Builder 📏",
    "phase": "Planning",
    "id": 15,
    "status": "pending",
    "journey_phase": "Planning",
    "toolsets_used": "Basic List → Likert Scale",
    "purpose": "Define exactly what \"Good\" looks like to prevent perfectionism.",
    "how_it_works": "The user and AI co-create a Basic List of success indicators (e.g., \"Shipped the code,\" \"Team is happy\"). Then, for the top 3 items, the AI presents a Likert Scale asking: \"What is the Minimum Viable Success level?\" (1=Bare Minimum, 5=Stretch Goal).",
    "output": "A definition of success that distinguishes \"Must Haves\" from \"Nice to Haves.\"",
    "why_this_works": "Perfectionists often burn out aiming for a \"5\" on everything. This forces them to consciously decide where a \"3\" is acceptable."
  },
  {
    "title": "The \"If-Then\" Architect 🧠",
    "phase": "Planning",
    "id": 16,
    "status": "pending",
    "journey_phase": "Planning",
    "toolsets_used": "Branch Point → Callout Text",
    "purpose": "Pre-program decisions for high-stress moments (Implementation Intentions).",
    "how_it_works": "The AI suggests a trigger scenario via Branch Point (e.g., \"If you feel too tired to work out...\"). The user selects the best response from two options (e.g., \"Do 5 mins only\" vs \"Skip and double up tomorrow\"). The AI then locks this into a Callout Text rule: \"Protocol: If tired, I do 5 mins.\"",
    "output": "A set of binary rules to reduce decision fatigue during execution.",
    "why_this_works": "Making decisions in the moment of stress is hard. Deciding now for later is the core of behavioral science (implementation intentions)."
  },
  {
    "title": "Theme of the Day ⚓",
    "phase": "Action",
    "id": 17,
    "status": "pending",
    "journey_phase": "Action (Daily Recurring)",
    "toolsets_used": "Deck → Callout Text",
    "purpose": "Set a single intentional focus to anchor the day's chaos.",
    "how_it_works": "In the morning, the user swipes through a Deck of \"Themes\" (e.g., Courage, Patience, Velocity, Listening, Boundaries). They pick one. The AI displays it in Callout Text and asks one question: \"How will you embody [Theme] in your 2pm meeting?\"",
    "output": "A specific psychological prime for the day.",
    "why_this_works": "It takes <60 seconds but significantly shapes perception. It turns a reactive day into a proactive one."
  },
  {
    "title": "The Rejection Gym 🥊",
    "phase": "Action",
    "id": 18,
    "status": "pending",
    "journey_phase": "Action",
    "toolsets_used": "Mock Chat",
    "purpose": "Practice the specific skill of saying \"No\" to protect time/focus.",
    "how_it_works": "The AI sets up a Mock Chat scenario: \"I am your boss, and I'm asking you to take on a new project, but you are at capacity. Say no without apologizing.\" The user practices the conversation 2-3 times.",
    "output": "\"Muscle memory\" for boundary setting.",
    "why_this_works": "People overcommit because they fear the awkwardness of the \"No.\" Practicing the phrasing de-risks the social interaction."
  },
  {
    "title": "The \"Done\" List (Anti-To-Do) ✅",
    "phase": "Action",
    "id": 19,
    "status": "pending",
    "journey_phase": "Action",
    "toolsets_used": "Basic List",
    "purpose": "Boost morale by making invisible labor visible.",
    "how_it_works": "Instead of listing what they need to do, the user uses a Basic List to log everything they did do today—especially the unplanned fires they put out.",
    "output": "A record of value creation that combats the feeling of \"I got nothing done today.\"",
    "why_this_works": "High performers often focus only on the gap (what's left). This forces focus on the gain (what's done), creating dopamine to keep going."
  },
  {
    "title": "The Decision Compass 🧭",
    "phase": "Action",
    "id": 20,
    "status": "pending",
    "journey_phase": "Action",
    "toolsets_used": "Quadrant",
    "purpose": "Make a specific, difficult choice quickly during the work week.",
    "how_it_works": "When the user is stuck on a choice (e.g., \"Should I launch now or wait?\"), the AI opens a Quadrant (X: Risk, Y: Reversibility). The user plots the option. If it lands in \"Low Risk / High Reversibility,\" the AI prompts: \"Why not do it now?\"",
    "output": "Immediate bias toward action (or caution) based on logic.",
    "why_this_works": "It moves the decision from \"feelings\" to \"coordinates.\" It helps users identify \"One-way doors\" vs \"Two-way doors.\""
  },
  {
    "title": "The Feedback Sorter 📥",
    "phase": "Integration",
    "id": 21,
    "status": "pending",
    "journey_phase": "Integration",
    "toolsets_used": "Basic List → Categories",
    "purpose": "Process criticism without taking it personally.",
    "how_it_works": "The user dumps recent feedback/criticism into a Basic List. Then, they use Categories to sort items into: \"Valid & Actionable,\" \"Interesting but Not Now,\" and \"Noise/Discard.\"",
    "output": "A filtered list of improvements to make, with the emotional weight removed from the \"Noise.\"",
    "why_this_works": "Criticism often feels like a monolith. Sorting it allows the user to psychologically reject the unhelpful parts while keeping the gold."
  },
  {
    "title": "Value Alignment Check ⚖️",
    "phase": "Integration",
    "id": 22,
    "status": "pending",
    "journey_phase": "Integration",
    "toolsets_used": "Categories",
    "purpose": "Audit if behavior matches the \"North Star\" values.",
    "how_it_works": "The AI retrieves the user's top 3 values. It presents Categories labeled with those values (plus a \"Misaligned\" column). The user drags this week's major calendar events into the corresponding value buckets.",
    "output": "A visual audit: \"You say you value Family, but 0 events went into that bucket.\"",
    "why_this_works": "It exposes the hypocrisy gap between stated values and actual time usage without the AI having to be \"judgy\"—the visual board does the judging."
  },
  {
    "title": "The Skill Audit 📊",
    "phase": "Integration",
    "id": 23,
    "status": "pending",
    "journey_phase": "Integration",
    "toolsets_used": "Likert Scale (x5)",
    "purpose": "Measure competency growth after a period of action.",
    "how_it_works": "The AI presents 5 specific skills related to the user's goal (e.g., \"Delegation,\" \"Strategic Thinking\"). The user rates themselves on a Likert Scale. If this is a repeat activity, the AI shows the delta: \"You're up +2 points on Delegation since last month.\"",
    "output": "Quantifiable proof of development.",
    "why_this_works": "Growth is slow and invisible. Seeing a number move from 2 to 4 validates the effort and creates ROI for the coaching engagement."
  },
  {
    "title": "The Chapter Close 📕",
    "phase": "Integration",
    "id": 24,
    "status": "pending",
    "journey_phase": "Integration",
    "toolsets_used": "Image Display → Callout Text",
    "purpose": "Synthesize a distinct phase of growth before moving to the next.",
    "how_it_works": "The AI shows an Image Display of the \"Hero's Journey\" arc. It asks, \"Where are you right now?\" (e.g., The Ordeal, The Reward, The Road Back). The user identifies their spot. The AI then synthesizes a \"Chapter Title\" for the last month via Callout Text.",
    "output": "Narrative closure on a period of struggle or success.",
    "why_this_works": "Humans make sense of life through story. Naming the chapter helps the user compartmentalize stress (\"That was 'The Month of Chaos'\") and move forward."
  },
  {
    "title": "The Scope Defender 🛡️",
    "phase": "Planning",
    "id": 25,
    "status": "pending",
    "journey_phase": "Planning",
    "toolsets_used": "Basic List → Categories",
    "purpose": "Prevent scope creep by explicitly defining what is not happening.",
    "how_it_works": "The user dumps all potential project tasks into a Basic List. Then, they use Categories to sort them into \"In Scope (Do Now)\" and \"Out of Scope (Parking Lot).\"",
    "output": "A protected boundary around the work to prevent overwhelm.",
    "why_this_works": "\"Scope creep\" kills progress. Physically dragging a task to a \"Parking Lot\" satisfies the brain's need to capture it without committing to do it."
  },
  {
    "title": "Sequence Logic 🔗",
    "phase": "Planning",
    "id": 26,
    "status": "pending",
    "journey_phase": "Planning",
    "toolsets_used": "Priorization",
    "purpose": "Turn a jumbled to-do list into a linear chronological path.",
    "how_it_works": "The AI presents the user's unorganized action steps. Using Priorization, the user drags them into the correct chronological order (Start → Finish). The AI checks the logic: \"Does step 2 actually unblock step 3?\"",
    "output": "A verified critical path.",
    "why_this_works": "Users often confuse \"Importance\" with \"Sequence.\" This tool forces them to think linearly about dependencies."
  },
  {
    "title": "The Blind Spot Check 👁️",
    "phase": "Planning",
    "id": 27,
    "status": "pending",
    "journey_phase": "Planning",
    "toolsets_used": "SME Council",
    "purpose": "Stress-test a plan against expert scrutiny before starting.",
    "how_it_works": "The user outlines their plan briefly. The AI generates an SME Council session (e.g., a Project Manager and a Risk Expert personas) who critique the plan and point out what is missing.",
    "output": "Identification of risks the user hadn't considered.",
    "why_this_works": "We are often too close to our own plans to see the holes. Simulated experts provide \"outside eyes\" instantly."
  },
  {
    "title": "The \"Why\" Anchor ⚓",
    "phase": "Planning",
    "id": 28,
    "status": "pending",
    "journey_phase": "Planning",
    "toolsets_used": "Branch Point (x3) → Callout Text",
    "purpose": "Drill down to intrinsic motivation to sustain effort later.",
    "how_it_works": "The AI asks \"Why does this goal matter?\" via Branch Point options (External vs Internal reasons). It repeats this 3 times (\"And why does that matter?\"), peeling the onion. The final intrinsic reason is locked in Callout Text.",
    "output": "A core emotional anchor (e.g., \"Not for the promotion, but for my family's security\").",
    "why_this_works": "Based on the \"5 Whys\" technique. Shallow motivation (\"I want a raise\") fails under stress; deep motivation (\"I want security\") survives."
  },
  {
    "title": "The Micro-Habit Stacker 🧱",
    "phase": "Action",
    "id": 29,
    "status": "pending",
    "journey_phase": "Action",
    "toolsets_used": "Basic List → Branch Point",
    "purpose": "Attach a new difficult behavior to an existing easy one.",
    "how_it_works": "The user lists existing daily habits (brushing teeth, coffee, commute) in a Basic List. They select one. The AI uses a Branch Point to ask: \"Do you want to do the new habit Before or After [Coffee]?\"",
    "output": "A precise implementation recipe: \"After I pour coffee, I will write one sentence.\"",
    "why_this_works": "\"Habit Stacking\" (BJ Fogg) is the gold standard for behavioral change. It relies on existing neural pathways rather than willpower."
  },
  {
    "title": "The Email Simulator 📧",
    "phase": "Action",
    "id": 30,
    "status": "pending",
    "journey_phase": "Action",
    "toolsets_used": "Mock Chat",
    "purpose": "Practice high-stakes written communication (tone check).",
    "how_it_works": "The user pastes a draft of a difficult email (or types it) into Mock Chat. The AI responds as the recipient (e.g., an angry client), showing how the tone lands. The user iterates until the AI recipient reacts well.",
    "output": "A battle-tested email draft ready to send.",
    "why_this_works": "Most people fear how their writing will be interpreted. Testing it against an AI persona removes the anxiety of clicking \"Send.\""
  },
  {
    "title": "Focus Blocker 🚫",
    "phase": "Action",
    "id": 31,
    "status": "pending",
    "journey_phase": "Action",
    "toolsets_used": "Categories",
    "purpose": "Externalize and categorize distractions to regain focus.",
    "how_it_works": "When the user feels scattered, the AI opens Categories (Columns: \"Internal Thoughts,\" \"External Interruptions\"). The user drags their current distractions into the buckets. The AI advises: \"Ignore the Internal, turn off notifications for External.\"",
    "output": "A cleared mind and a specific tactic for the dominant distraction type.",
    "why_this_works": "Naming the distraction tames it. Realizing \"Oh, 90% of this is just my own anxiety (Internal)\" is a powerful reframe."
  },
  {
    "title": "Pulse Check (Head/Heart/Hands) 🩺",
    "phase": "Action",
    "id": 32,
    "status": "pending",
    "journey_phase": "Action (Daily/Weekly)",
    "toolsets_used": "Slider (x3)",
    "purpose": "Rapid diagnostic of where the friction lies.",
    "how_it_works": "The AI presents three Sliders:",
    "output": "Identification of the specific bottleneck.",
    "why_this_works": "Users often say \"I'm stuck.\" This dissects \"stuck\" into actionable components. Low \"Head\" needs a plan; low \"Heart\" needs a break."
  },
  {
    "title": "The Time ROI Matrix ⏳",
    "phase": "Integration",
    "id": 33,
    "status": "pending",
    "journey_phase": "Integration",
    "toolsets_used": "Quadrant",
    "purpose": "Evaluate if time spent matches value created.",
    "how_it_works": "The AI asks the user to plot this week's meetings/tasks on a Quadrant (X: Time Consumed, Y: Value/Progress Generated).",
    "output": "Visual identification of \"Time Wasters\" (High Time/Low Value).",
    "why_this_works": "We often feel busy but not productive. Seeing a recurring meeting in the \"High Time / Low Value\" quadrant triggers immediate calendar pruning."
  },
  {
    "title": "Pattern Spotter 🕸️",
    "phase": "Integration",
    "id": 34,
    "status": "pending",
    "journey_phase": "Integration",
    "toolsets_used": "Mind Map",
    "purpose": "Connect disparate events to find a recurring theme.",
    "how_it_works": "The AI seeds a Mind Map with 3-4 struggles or wins the user mentioned recently. It asks the user to draw connections (lines) between them and name the central node that connects them.",
    "output": "A \"Meta-Insight\" (e.g., \"All these issues stem from lack of sleep\").",
    "why_this_works": "Reflection is often linear (journaling). Mind Maps allow for non-linear synthesis, identifying root causes that linear thinking misses."
  },
  {
    "title": "Advice to Your Future Self 🔮",
    "phase": "Integration",
    "id": 35,
    "status": "pending",
    "journey_phase": "Integration",
    "toolsets_used": "Callout Text → Image Display",
    "purpose": "Solidify learning by teaching it.",
    "how_it_works": "The AI asks, \"If you could send a message to yourself next Monday, what would it be?\" The user dictates it. The AI displays it nicely in Callout Text, then uses Image Display to show a \"Message Sent\" visual (reinforcement).",
    "output": "A specific intention set for the next cycle.",
    "why_this_works": "The \"Proteus Effect\"—we learn best when we teach/advise. It shifts the user from \"Passive Learner\" to \"Wise Advisor.\""
  },
  {
    "title": "The Goal Cleaner 🧹",
    "phase": "Integration",
    "id": 36,
    "status": "pending",
    "journey_phase": "Integration",
    "toolsets_used": "Deck",
    "purpose": "Prune outdated goals to free up mental RAM.",
    "how_it_works": "The AI puts the user's active goals/commitments onto cards in a Deck. The user swipes Left to \"Drop/Pause\" and Right to \"Keep/Renew.\"",
    "output": "A curated, lighter list of commitments.",
    "why_this_works": "We rarely officially \"quit\" goals; we just let them haunt us. Swiping Left is a ritual act of letting go, reducing guilt and freeing energy."
  },
  {
    "title": "The \"Not My Job\" Sorter 🙅",
    "phase": "Planning",
    "id": 37,
    "status": "pending",
    "journey_phase": "Planning",
    "toolsets_used": "Categories",
    "purpose": "Clarify role boundaries to prevent burnout and resentment.",
    "how_it_works": "The AI loads Categories with columns: \"Core Responsibility,\" \"Favor/Extra,\" and \"Someone Else's Job.\" The user drags their current task list into these buckets.",
    "output": "A visual permission slip to stop doing work that belongs to others.",
    "why_this_works": "Role ambiguity is a top driver of workplace stress. Visual sorting forces the user to acknowledge they are carrying loads they shouldn't be."
  },
  {
    "title": "The Buy-In Barometer 🌡️",
    "phase": "Planning",
    "id": 38,
    "status": "pending",
    "journey_phase": "Planning",
    "toolsets_used": "Deck → Slider",
    "purpose": "Assess if you have the political capital needed to launch.",
    "how_it_works": "The user swipes through a Deck of key stakeholders (Boss, Team, Cross-functional partners). For each selected person, a Slider appears: \"How much buy-in do they have right now?\" (0-100%).",
    "output": "A \"heat map\" of political risk showing exactly who needs to be influenced before launch.",
    "why_this_works": "Plans often fail because we assume people are on board. This forces a realistic assessment of the social landscape."
  },
  {
    "title": "The Meeting Detox 🗑️",
    "phase": "Planning",
    "id": 39,
    "status": "pending",
    "journey_phase": "Planning",
    "toolsets_used": "Priorization",
    "purpose": "Reclaim time by cutting low-value recurring meetings.",
    "how_it_works": "The user lists their recurring meetings in the Priorization tool. They rank them from \"High Value\" to \"Time Waster.\" The AI prompts the user to cancel or decline the bottom 20%.",
    "output": "Immediate calendar whitespace recovered.",
    "why_this_works": "We rarely audit our calendars. Ranking forces a comparison, making it obvious which meetings are \"zombies\" (alive but dead)."
  },
  {
    "title": "The Scenario Spinner 🎲",
    "phase": "Planning",
    "id": 40,
    "status": "pending",
    "journey_phase": "Planning",
    "toolsets_used": "Deck → Branch Point",
    "purpose": "Prepare for specific \"What If\" disasters without anxiety.",
    "how_it_works": "The AI presents a Deck of common disruptions (e.g., \"Budget Cut,\" \"Key Person Quits,\" \"Tech Failure\"). The user picks one they fear. A Branch Point asks: \"Would you Pause or Pivot?\" The AI helps define the pivot.",
    "output": "A specific contingency plan for the biggest fear.",
    "why_this_works": "\"Defensive Pessimism\"—imagining the worst-case scenario specifically (rather than vaguely) actually reduces anxiety because you realize you have a plan."
  },
  {
    "title": "Name It to Tame It 🏷️",
    "phase": "Action",
    "id": 41,
    "status": "pending",
    "journey_phase": "Action",
    "toolsets_used": "Deck → Callout Text",
    "purpose": "rapid emotional regulation during stress.",
    "how_it_works": "When the user indicates stress, the AI opens a Deck of specific emotion cards (e.g., \"Overwhelmed,\" \"Resentful,\" \"Inadequate,\" \"Lonely\"). The user picks one. The AI validates it via Callout Text: \"It makes sense you feel Resentful because...\"",
    "output": "Lowered cortisol and emotional validation.",
    "why_this_works": "Neuroscience shows that labeling an emotion (affect labeling) reduces activity in the amygdala. The Deck provides the vocabulary when the user is too stressed to find words."
  },
  {
    "title": "The 5-Minute Sprint ⏱️",
    "phase": "Action",
    "id": 42,
    "status": "pending",
    "journey_phase": "Action",
    "toolsets_used": "Basic List",
    "purpose": "Break procrastination paralysis with micro-actions.",
    "how_it_works": "The AI asks: \"What can you do in the next 5 minutes?\" The user populates a Basic List with 3 tiny items (e.g., \"Open the doc,\" \"Write title,\" \"Find email address\"). The AI says: \"Go. I'll wait.\"",
    "output": "Momentum. The hardest part is starting.",
    "why_this_works": "Newton's Law: Objects in motion stay in motion. This lowers the activation energy required to start."
  },
  {
    "title": "The Presentation Polish 🎤",
    "phase": "Action",
    "id": 43,
    "status": "pending",
    "journey_phase": "Action",
    "toolsets_used": "Mock Chat",
    "purpose": "Test the \"Hook\" of a presentation or speech.",
    "how_it_works": "The user types the opening 3 sentences of their upcoming presentation into Mock Chat. The AI (persona: Distracted Audience Member) reacts—either getting hooked or checking their phone. The user iterates until the AI pays attention.",
    "output": "A compelling opening hook.",
    "why_this_works": "We often write presentations linearly. This focuses entirely on the first 30 seconds, which dictates whether the audience listens to the rest."
  },
  {
    "title": "The Trigger Map 📍",
    "phase": "Action",
    "id": 44,
    "status": "pending",
    "journey_phase": "Action",
    "toolsets_used": "Quadrant",
    "purpose": "Identify when and where bad habits occur.",
    "how_it_works": "The AI opens a Quadrant (X: Time of Day, Y: Social Context). The user plots recent slip-ups (e.g., \"Snacking,\" \"Procrastinating\").",
    "output": "A pattern diagnosis (e.g., \"You mostly slip up alone at night\" vs. \"You slip up when around Dave\").",
    "why_this_works": "Habits are context-dependent. Changing the context is easier than willing yourself to change the behavior."
  },
  {
    "title": "The Flow State Map 🌊",
    "phase": "Integration",
    "id": 45,
    "status": "pending",
    "journey_phase": "Integration",
    "toolsets_used": "Quadrant",
    "purpose": "Optimize work for peak performance (Flow).",
    "how_it_works": "The AI presents the classic Flow Quadrant (X: Skill Level, Y: Challenge Level). The user plots their current projects.",
    "output": "Specific adjustments (e.g., \"Increase the challenge on Project A to stop being bored\").",
    "why_this_works": "Flow theory (Csikszentmihalyi) is the science of optimal engagement. This visualizes why a user feels bored or burnt out."
  },
  {
    "title": "The \"Un-Learning\" List 🧠",
    "phase": "Integration",
    "id": 46,
    "status": "pending",
    "journey_phase": "Integration",
    "toolsets_used": "Basic List → Priorization",
    "purpose": "Identify habits that served you in the past but hurt you now.",
    "how_it_works": "The user lists behaviors they want to stop in a Basic List. Then they use Priorization to rank them by \"Most Toxic to Current Goal.\"",
    "output": "A \"Stop Doing\" list.",
    "why_this_works": "\"What got you here won't get you there.\" High performers often cling to old behaviors (e.g., \"Doing it myself\") that become liabilities as they grow."
  },
  {
    "title": "Effort vs. Outcome 🎲",
    "phase": "Integration",
    "id": 47,
    "status": "pending",
    "journey_phase": "Integration",
    "toolsets_used": "Slider (x2)",
    "purpose": "Distinguish between \"Good Process\" and \"Good Luck.\"",
    "how_it_works": "The user identifies a recent win or loss.",
    "output": "A realistic appraisal of performance.",
    "why_this_works": "We often judge decisions by outcomes (Resulting Bias). This separates the decision quality from the result."
  },
  {
    "title": "The Gratitude Graph 🤝",
    "phase": "Integration",
    "id": 48,
    "status": "pending",
    "journey_phase": "Integration",
    "toolsets_used": "Mind Map",
    "purpose": "Recognize the support system to build resilience.",
    "how_it_works": "The AI centers a Mind Map on \"My Success.\" The user adds nodes for people who helped them this week. They draw lines connecting how those people supported each other.",
    "output": "A visual web of support.",
    "why_this_works": "High achievers often feel \"alone at the top.\" Visualizing the network proves they are supported, increasing psychological safety and resilience."
  }
]